//Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

Console.Write("Введите первое число: ");
 int numer1= int.Parse(Console.ReadLine());
Console.Write ("Введите второе число: ");
int numer2= int.Parse(Console.ReadLine());
Console.Write ("Введите третье число: ");
int numer3= int.Parse(Console.ReadLine());
 int max = number1;
if (max< number2);
 {
    max=number2;
 }
if (max< number3) int.MaxValue = num2;
{
    max= number3;
}
Console.WriteLine( $" максимальное число = { max } " );
 